package com.fattytiger.ai.pdfbox;

import java.io.File;
import java.io.IOException;
import org.apache.pdfbox.pdmodel.PDDocument;
import org.apache.pdfbox.text.PDFTextStripper;


/* page1
百年康惠保重大疾病保险条款
1 / 22
百年康惠保重大疾病保险条款
本阅读指引有助于您理解条款，对本合同内容的解释以条款为准。
 您拥有的重要权益
 签收本合同之日起15日（即犹豫期）内您可以要求解除合同并退还已交的保险费
 您有退保的权利
 您应当特别注意的事项
 请您认真阅读免除百年人寿责任的条款
 保险事故发生后请您及时通知百年人寿
 退保会给您造成一定的损失，请您慎重决策
 您有如实告知的义务
 本保险条款每个第一次出现的释义名词在下面有脚注，其他相同的释义名词不另作标注。
 条款目录
在本条款中，“您”指投保人，“百年人寿”指百年人寿保险股份有限公司，“本合同”指您与百年人寿
之间订立的“百年康惠保重大疾病保险合同”。
阅 读 指 引
1．保什么、保多久
1.1 保险责任
1.2 保险期间
2．不保什么
2.1 责任免除
2.2 其他免责条款
3．如何支付保险费
3.1 保险费的交纳
3.2 宽限期
3.3 效力中止与恢复
4. 如何领取保险金
4.1 受益人
4.2 保险事故通知
4.3 保险金申请
4.4 保险金给付
4.5 诉讼时效
5．如何退保
5.1 犹豫期
5.2 您解除合同的手续
6．还需要注意哪些事项
6.1 合同构成
6.2 合同成立与生效
6.3 合同效力终止
6.4 投保年龄
6.5 年龄性别错误
6.6 明确说明与如实告知
6.7 未还款项
6.8 合同内容变更
6.9 地址变更
6.10 争议处理
7．重大疾病
7.1 重大疾病范围
7.2 重大疾病定义
 */

/* page2
百年康惠保重大疾病保险条款
2 / 22
⒈ 保什么、保多久
这部分描述的是您通过本合同可以在百年人寿获得哪些保障及提供保障的期间。
1.1 保险责任 在本合同有效期间内，百年人寿承担下列保险责任：
1.1.1 等待期 本合同生效日或本合同中止后的最后复效日（以较迟者为准）起 180 日为
等待期。等待期是指本合同生效后百年人寿不承担保险责任的一段时间。
发生以下情形之一时，百年人寿不承担保险责任，但无息返还已交的保险
费（不计利息），本合同效力终止。
(1）等待期内被保险人经认可的医院
1
确诊初次患上一种或多种本合同所
约定的重大疾病；
(2）等待期内被保险人己经发生的疾病、症状或病理改变且延续到等待期
以后经认可的医院确诊初次患上一种或多种本合同所约定的重大疾病。
因意外伤害
2
导致的保险事故，不受上述时间的限制。
1.1.2 重大疾病保险金 被保险人在等待期以后经认可的医院首次确诊初次患上一种或多种本合同所
约定的重大疾病（100 种重大疾病），百年人寿按照合同约定的基本保额
3
给付
重大疾病保险金，本合同效力终止。
1.2 保险期间 本合同的保险期间自本合同生效日起至被保险人 70 周岁
4
的保单周年日
5
或被
保险人身故时止，保险期间自生效日起算。
⒉ 不保什么
这部分描述的是百年人寿不承担保险责任的情况。
2.1 责任免除 因下列情形之一，导致被保险人发生疾病、达到疾病状态或进行手术的，
百年人寿不承担给付保险金的责任：
（1）投保人对被保险人的故意杀害、故意伤害；
（2）因被保险人故意自伤、故意犯罪或抗拒依法采取的刑事强制措施；
（3）被保险人在本合同成立或合同效力最后恢复之日起二年内自杀，但
被保险人自杀时为无民事行为能力人的除外；
（4）被保险人服用、吸食或注射毒品
6
或未遵医嘱使用管制药品
7
；
1
认可的医院指经国家卫生行政部门评审确定的二级或二级以上的公立医院，但不包括精神病院及专供康复、
休养、戒毒、戒酒、护理、养老等非以直接诊治病人为目的的医疗机构。该医院必须具有符合国家有关医院
管理规则设置标准的医疗设备，且全天 24 小时有合格医师及护士驻院提供医疗及护理服务。
2
意外伤害指遭受外来的、突发的、非本意的、非疾病的客观事件直接致使身体受到的伤害。
3
基本保额为本合同保险费的计算基础，由您与百年人寿约定并在保险单上载明。
4
周岁指按法定有效身份证明文件中记载的出生日期计算的年龄，自出生之日起为零周岁，每经过一年增加一
岁，不足一年的不计。
5
保单周年日指本合同生效日以后每年的对应日为保单周年日，如果当月无对应的同一日，则以该月最后一日
作为对应日。
6
毒品指中华人民共和国刑法规定的鸦片、海洛因、甲基苯丙胺（冰毒）、吗啡、大麻、可卡因以及国家规定管
制的其他能够使人形成瘾癖的麻醉药品和精神药品，但不包括由医生开具用于治疗疾病的含有毒品成分的处
方药品。
7
管制药品指根据《中华人民共和国药品管理法》及有关法规被列为特殊管理的药品，包括麻醉药品、精神药
品、医疗用毒性药品及放射性药品。
 */

public class PdfReadText {
    public static void main(String[] args) throws IOException {

        File myFile = new File("/home/jiangjie/文档/保险计划书/百年康惠保重大疾病保险条款.pdf");

        try (PDDocument doc = PDDocument.load(myFile)) {

            PDFTextStripper stripper = new PDFTextStripper();

            stripper.setStartPage(2);
            stripper.setEndPage(2);

            String text = stripper.getText(doc);

            System.out.println("Text size: " + text.length() + " characters:");
            System.out.println(text);
        }
    }
}
